Catalogs/упТипыТС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>упТипыТС</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидТранспорта</Name>
					<Type>
						<v8:Type>cfg:EnumRef.упВидыТранспорта</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Высота</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЛинейныеРазмеры</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Грузоподъемность</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Масса</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Длина</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЛинейныеРазмеры</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоступныеЗоны</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упПравилаДоступностиГеографическихЗон</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоЗагрузочныхМетров</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КоличествоЗагрузочныхМетров</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоМест</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КоличествоМест</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоПосадочныхМест</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоэффициентРасчетаВремениВПути</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Объем</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Объем</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СнаряженнаяМасса</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Масса</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТемпературныйРежим</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упТемпературныеРежимы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипГрузаКонтейнера</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упТипыГрузов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипКузова</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упТипыКузововТС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ширина</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЛинейныеРазмеры</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДопустимыеКлассыОпасныхГрузов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КлассОпасности</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.упКлассыОпасности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СтатьиРасходов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СтатьяРасходов</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.упСтатьиДоходовРасходов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>УстанавливаемоеОборудование</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТипОборудования</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.упТипыДополнительногоОборудования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВремяМонтажа</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ВремяРаботы</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВремяДемонтажа</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ВремяРаботы</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/упВидыТранспорта.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>упВидыТранспорта</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Водный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Воздушный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЛегковойАвтомобиль</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГрузовойАвтомобиль</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Спецтехника</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Автобус</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Железнодорожный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Контейнер</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/упВариантыВыбораПеревозчика.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>упВариантыВыбораПеревозчика</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПеревозкаСобственнымиТС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеревозкаОпределеннымПеревозчиком</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НепосредственныйВыборВРейсе</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОформляетсяТендер</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОпределяетсяДляКаждогоРейсаИндивидуально</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/упТипыТС/Forms/ФормаВыбораКонтейнера/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Параметры.ВидПеревозки) Тогда
		мсвТиповТС = ПолучитьДоступныеТипыТС();
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Ссылка", мсвТиповТС, ВидСравненияКомпоновкиДанных.ВСписке);	
	КонецЕсли;
	
	Если Не Параметры.Отбор.Свойство("ВидТранспорта") Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "ВидТранспорта", Перечисления.упВидыТранспорта.Контейнер, ВидСравненияКомпоновкиДанных.Равно);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиСобытийЭлементовФормы

// Нет.

#КонецОбласти 

#Область ОбработчикиСобытийКоманд

// Нет.

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьДоступныеТипыТС()
	
	мсвТиповТС = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	упВидыПеревозок.Ссылка,
	|	упВидыПеревозок.ВыборПеревозчика КАК ВариантВыбораПеревозчика,
	|	упВидыПеревозок.Перевозчик
	|ПОМЕСТИТЬ втВидыПеревозок
	|ИЗ
	|	Справочник.упВидыПеревозок КАК упВидыПеревозок
	|ГДЕ
	|	упВидыПеревозок.Ссылка = &ВидПеревозки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	упПартнеры.Ссылка КАК Перевозчик
	|ПОМЕСТИТЬ втПеревозчики
	|ИЗ
	|	Справочник.упПартнеры КАК упПартнеры
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втВидыПеревозок КАК втВидыПеревозок
	|		ПО (втВидыПеревозок.ВариантВыбораПеревозчика = ЗНАЧЕНИЕ(Перечисление.упВариантыВыбораПеревозчика.ПеревозкаСобственнымиТС))
	|			И (упПартнеры.Организация = &Организация)
	|			И (НЕ упПартнеры.ПометкаУдаления)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	втВидыПеревозок.Перевозчик
	|ИЗ
	|	втВидыПеревозок КАК втВидыПеревозок
	|ГДЕ
	|	втВидыПеревозок.ВариантВыбораПеревозчика = ЗНАЧЕНИЕ(Перечисление.упВариантыВыбораПеревозчика.ПеревозкаОпределеннымПеревозчиком)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	упПартнеры.Ссылка
	|ИЗ
	|	Справочник.упПартнеры КАК упПартнеры
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втВидыПеревозок КАК втВидыПеревозок
	|		ПО (упПартнеры.Перевозчик)
	|			И (НЕ упПартнеры.ПометкаУдаления)
	|			И (втВидыПеревозок.ВариантВыбораПеревозчика В (ЗНАЧЕНИЕ(Перечисление.упВариантыВыбораПеревозчика.НепосредственныйВыборВРейсе), ЗНАЧЕНИЕ(Перечисление.упВариантыВыбораПеревозчика.ОпределяетсяДляКаждогоРейсаИндивидуально)))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	упТипыТС.Ссылка КАК ТипТС
	|ИЗ
	|	Справочник.упТипыТС КАК упТипыТС
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втВидыПеревозок КАК втВидыПеревозок
	|		ПО (втВидыПеревозок.ВариантВыбораПеревозчика В (ЗНАЧЕНИЕ(Перечисление.упВариантыВыбораПеревозчика.НепосредственныйВыборВРейсе), ЗНАЧЕНИЕ(Перечисление.упВариантыВыбораПеревозчика.ОформляетсяТендер), ЗНАЧЕНИЕ(Перечисление.упВариантыВыбораПеревозчика.ОпределяетсяДляКаждогоРейсаИндивидуально)))
	|			И (&Перевозчик = ЗНАЧЕНИЕ(Справочник.упПартнеры.ПустаяСсылка))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	упТипыТС.Ссылка
	|ИЗ
	|	Справочник.упТипыТС КАК упТипыТС
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.упПартнеры.ДоступныеТипыТС КАК ДоступныеТипыТС
	|		ПО упТипыТС.Ссылка = ДоступныеТипыТС.ТипТС
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втПеревозчики КАК втПеревозчики
	|		ПО (втПеревозчики.Перевозчик = ДоступныеТипыТС.Ссылка)
	|			И (&Перевозчик В (втПеревозчики.Перевозчик, ЗНАЧЕНИЕ(Справочник.упПартнеры.ПустаяСсылка)))";
	Запрос.УстановитьПараметр("ВидПеревозки", Параметры.ВидПеревозки);
	Запрос.УстановитьПараметр("Перевозчик"  , Параметры.Перевозчик);
	Запрос.УстановитьПараметр("Организация" , Параметры.Организация);
	Результат = Запрос.Выполнить();
	Если Не Результат.Пустой() Тогда
		мсвТиповТС = Результат.Выгрузить().ВыгрузитьКолонку("ТипТС");
	КонецЕсли; 
	
	Возврат мсвТиповТС;
	
КонецФункции

#КонецОбласти
